---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsWinderInvalidParamsFailure
source: html/648b9010-1fe4-13d8-b87c-a2a73a9b07df.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsWinderInvalidParamsFailure Property

Cannot create the winder run because some values for the instance properties cannot be satisfied.

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsWinderInvalidParamsFailure { get; }
```